InformationRegisters/МатериальноОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МатериальноОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗонаОтветственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/МатериальноОтветственныеЛицаВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкиЗаполнения

Функция ПроверкаМатериальнойОтветственностиФизическихЛиц(Организация, ФизическиеЛица, ТолькоАктуальные) Экспорт
	
	МатериальнаяОтветственностьФизическихЛиц = Новый Соответствие;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.МатериальноОтветственныеЛица) Тогда
		Возврат МатериальнаяОтветственностьФизическихЛиц;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("УчитыватьМатериальнуюОтветственностьСотрудников") Тогда
		Возврат МатериальнаяОтветственностьФизическихЛиц;
	КонецЕсли;
	
	РегистрыСведений.МатериальноОтветственныеЛица.МатериальнаяОтветственность(Организация, ФизическиеЛица, ТолькоАктуальные, МатериальнаяОтветственностьФизическихЛиц);
	
	Возврат МатериальнаяОтветственностьФизическихЛиц;
	
КонецФункции

Функция ФизическиеЛицаСотрудников(Сотрудники) Экспорт
	
	ФизическиеЛица = ОбщегоНазначения.ВыгрузитьКолонку(
		ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сотрудники, "ФизическоеЛицо"),
		"Значение");
		
	Возврат ФизическиеЛица;
	
КонецФункции

#КонецОбласти

#КонецОбласти
